export const BASE_URL = '';
// export const BASE_URL = 'http://66bc8f1.r19.vip.cpolar.cn/p-server';

//**PT 2024-10-23 12:59
// [
// 	{
// 		"content": "欢迎来到yaChat聊天室！",
// 		"sender": "Server",
// 		"time": "2024-10-22T15:59:15.554Z"
// 	},
// 	{
// 		"content": "你好",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T15:59:57.041Z"
// 	},
// 	{
// 		"content": "后端用的技术还是太原始了",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:07:09.834Z"
// 	},
// 	{
// 		"content": "本来想学一下规范的用法的但是太赶了还是算了",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:07:22.667Z"
// 	},
// 	{
// 		"content": "应该不会出bug了吧😥",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:32:19.506Z"
// 	},
// 	{
// 		"content": "zygg",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:33:29.168Z"
// 	},
// 	{
// 		"content": "vocal！",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:33:37.576Z"
// 	},
// 	{
// 		"content": "厉害",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:33:41.090Z"
// 	},
// 	{
// 		"content": "az",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:33:44.565Z"
// 	},
// 	{
// 		"content": "进来了哈哈哈",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:33:48.424Z"
// 	},
// 	{
// 		"content": "😂还是太简陋了",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:34:03.417Z"
// 	},
// 	{
// 		"content": "教我本领（可怜）",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:34:05.275Z"
// 	},
// 	{
// 		"content": "😂",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:34:08.831Z"
// 	},
// 	{
// 		"content": "慢慢来哈哈哈",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:34:13.584Z"
// 	},
// 	{
// 		"content": "😭",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:34:19.677Z"
// 	},
// 	{
// 		"content": "可以很多人和你一起聊吗",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:34:33.968Z"
// 	},
// 	{
// 		"content": "这个东西要租服务器啥的？",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:34:51.213Z"
// 	},
// 	{
// 		"content": "太牛了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:35:11.053Z"
// 	},
// 	{
// 		"content": "啊没",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:35:48.411Z"
// 	},
// 	{
// 		"content": "说了这个是简陋版本的哈哈",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:36:01.012Z"
// 	},
// 	{
// 		"content": "服务器是用我电脑搭的",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:36:16.517Z"
// 	},
// 	{
// 		"content": "我也想搭一个",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:22.970Z"
// 	},
// 	{
// 		"content": "😂",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:36:27.848Z"
// 	},
// 	{
// 		"content": "需要哪些基础知识呢",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:29.055Z"
// 	},
// 	{
// 		"content": "我想在我朋友面前装*",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:39.344Z"
// 	},
// 	{
// 		"content": "😭😭😭😭",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:43.836Z"
// 	},
// 	{
// 		"content": "太牛了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:52.530Z"
// 	},
// 	{
// 		"content": "太牛了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:36:55.386Z"
// 	},
// 	{
// 		"content": "有个问题……这手机上打字的时候不能自动滚到底部",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:36:55.961Z"
// 	},
// 	{
// 		"content": "😂😂😂😂要装还是算了吧",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:37:05.542Z"
// 	},
// 	{
// 		"content": "已经很好了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:37:10.266Z"
// 	},
// 	{
// 		"content": "这点东西真的拿不出手",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:37:12.357Z"
// 	},
// 	{
// 		"content": "😂😂😂",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:37:25.768Z"
// 	},
// 	{
// 		"content": "md为了搞这个我宿舍还没回😓先回一下宿舍（）",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:37:44.067Z"
// 	},
// 	{
// 		"content": "没没没真的",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:37:51.682Z"
// 	},
// 	{
// 		"content": "你知道我这个是怎么实现消息同步的吗",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:03.269Z"
// 	},
// 	{
// 		"content": "好牛了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:38:05.049Z"
// 	},
// 	{
// 		"content": "",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:04.107Z"
// 	},
// 	{
// 		"content": "你可以截图我看一下你的界面吗",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:38:12.918Z"
// 	},
// 	{
// 		"content": "是每1s向服务器请求一次（）",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:22.146Z"
// 	},
// 	{
// 		"content": "但是真正规范高效多了",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:33.801Z"
// 	},
// 	{
// 		"content": "？",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:35.070Z"
// 	},
// 	{
// 		"content": "哪的界面",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:42.938Z"
// 	},
// 	{
// 		"content": "我现在用手机",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:47.044Z"
// 	},
// 	{
// 		"content": "效果差不多吧",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:49.707Z"
// 	},
// 	{
// 		"content": "先回宿舍先回宿舍太晚了（）",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:38:59.713Z"
// 	},
// 	{
// 		"content": "没有做pc端的ui适配",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:39:20.421Z"
// 	},
// 	{
// 		"content": "已经很牛了",
// 		"sender": "shw",
// 		"time": "2024-10-22T16:41:55.362Z"
// 	},
// 	{
// 		"content": "😂",
// 		"sender": "Woisol",
// 		"time": "2024-10-22T16:44:25.608Z"
// 	}
// ]